Revit 2026 API

# TemporaryViewModesGetCaption Method

---

A text caption to use for the given mode.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string GetCaption(
	TemporaryViewMode mode
)
```
```vb
Public Function GetCaption (
	mode As TemporaryViewMode
) As String
```
```cpp
public:
String^ GetCaption(
	TemporaryViewMode mode
)
```
```fsharp
member GetCaption :
        mode : TemporaryViewMode -> string
```

#### Parameters

mode TemporaryViewMode
     The mode to get a caption for.

#### Return Value

String Text of the caption. The text is localized.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

The text appears in the UI on the temporary frame when the view is in the temporary mode.

#### Reference

TemporaryViewModes Class

Autodesk.Revit.DB Namespace